<template>
  <div style="margin: 2.5%">
    <div style="text-align: center;font-size: 25px;color: rgba(1, 239, 183, 0.73">番茄叶片病害防治措施</div>
    <el-carousel :interval="4000" type="card" height="500px">
      <el-carousel-item v-for="item in info" :key="item.name">
        <div style="margin-top: 2%">
          <h2 style="text-align: center;">{{ item.name }}</h2>
          <div style="margin: 0 2% ">
            <b style="color: crimson">病害简介：</b>
            {{item.jianjie}}
            <br>
            <b style="color: crimson">防治措施：</b>
            {{item.fangzhi}}
          </div>
        </div>
      </el-carousel-item>
    </el-carousel>
  </div>
</template>
<script lang="ts" setup>
import {ref} from 'vue'
const info=ref(
[{
  name:'番茄早疫病（Early_blight）',
  jianjie:"番茄早疫病在我国东北、华北、华东、西南等地区都有发生，其最主要特征是不论发生在果实、叶片或主茎上的病斑，都有明显的轮纹，\n" +
    "            所以又被称作轮纹病。果实病斑常在果蒂附近，茎部病斑常在分杈处，叶部病斑发生在叶肉上。\n" +
    "            各地普遍发生，是危害番茄的重要病害之一。一直以来，一些地区由于推广抗病毒病而不抗早疫病的番茄品种，\n" +
    "            导致早疫病严重发生。此病原寄主范围广泛，除危害番茄外，还可危害茄子、辣椒等等茄科蔬菜作物和马铃薯。",
  fangzhi:"            1、品种选择：选择抗病品种，迪丽雅、欧缇丽、凯旋158等品种较抗病，在重病区可选用。一般早熟品种、窄叶品种发病偏轻，高棵、大秧、大叶品种发病偏重。\n" +
    "            2、注意轮作：鉴于病原能有一年以上的存活期，所以要注意轮作。一般是与非茄科作物进行两年以上的轮作。在选择育苗床时，也要引起足够的重视。\n" +
    "            3、种子处理：在注意从无病地块、无病植株上选留种子的基础上，对采后的种子除结合其他病害的预防，用70℃干热处理72小时法进行处理外（注意采后对种子给予一定的后熟转化期），在播前可用52℃温水、自然降温处理30分钟，然后冷水浸种催芽。\n" +
    "            4、药剂防治：发病初期，及时摘除病叶、病果及严重病枝，开始喷施杀菌农药，为防止产生抗药性提高防效，提倡轮换交替或复配使用。每7天喷1次，连喷2～3次。发病较重时，清除中心病株、病叶等。",
},
  {
    name:'番茄叶霉病（Leaf_Mold）',
    jianjie:"番茄叶霉病是由黄褐孢霉菌引起的番茄病害，主要危害叶片，严重时也危害茎、花和果实。此病害在中国大部分番茄种植区均有发生。温度在4～32℃病菌均可生长，20～25℃最为适宜，孢子萌发和侵入要求相对湿度80%以上。气温22℃左右，湿度90%以上病害发生严重。保护地高湿，或遇连续阴雨天，光照较弱亦有利于病害发生发展。该病是保护地番茄上的重要叶部病害，露地番茄虽有发生，但不及保护地番茄上严重。番茄发病后使叶片变黄枯萎，严重影响光合作用和营养合成，降低番茄产量和品质。",
    fangzhi:"1、选用抗病品种。番茄品种间对番茄叶霉病的抗性有明显差异。各地选择抗叶霉病的番茄品种，应注意生理小种的消长，及时更换品种。2、加强栽培管理。采用双垄覆盖地膜及膜下灌水的栽培方式，除可以增强土壤湿度外，还可明显降低棚内空气湿度，抑制番茄叶霉病的发生；对棚室番茄采用生态防治法，如控制棚内温、湿度，适时通风，适当控制浇水，水后及时排湿，降低温、湿度；露地番茄要注意田间的通风透光，不宜种植过密，并适当增施磷、钾肥，提高植株的抗病能力；雨季及时排水，以降低田间湿度；及时整枝打杈，摘除病叶、老叶，增强通风；滴灌可降低棚室的相对湿度，勿大水漫灌。3、轮作发病重的地区，应与非茄科作物实行3年以上轮作。\n" +
      "化学防治：1、连年发病严重的温室或大棚，在番茄定植前进行消毒处理。用硫磺粉重蒸大棚和温室，每100米3空间，用硫磺0.25千克，锯末0.5千克，混合后，分放几处，点燃后密闭大棚，闷熏一夜。如果先密闭大棚使棚温升至20℃以上处理，效果更好。2、种子处理。从无病株上采种；进行种子处理，52℃浸种30分，晾干播种；2%武夷霉素或硫酸铜浸种，或用50%克菌丹按种子重量0.4%拌种。3、病害始发期，保护地番茄用百菌清烟剂3～3.75千克/公顷熏蒸，或喷撒叶霉净粉尘剂、百菌清粉尘剂或敌托粉尘剂，间隔8～10天喷1次。交替轮换施用。发病初期，摘除下部病叶片后及时喷药保护，重点喷洒叶片背面。有效药剂有多菌灵、异菌脲、武夷霉素、多·硫悬浮剂、甲基硫菌灵、百菌清、氟硅唑、苯醚甲环唑等。\n",
  },
  {
    name:'番茄晚疫病（Late_blight）',
    jianjie:'番茄晚疫病是由疫霉菌侵染所引起的、发生在番茄上的病害。番茄晚疫病在番茄的整个生育期均可发生，幼苗、叶、茎、果实均可发病。番茄晚疫病是一种毁灭性的病害，在番茄种植区域普遍发生。特别是在冬季设施栽培的番茄，因高湿低温易发病。该病一旦发生传播迅速，一般减产50%左右，严重时毁种绝收。',
    fangzhi:'种植抗病品种：中国国内较抗番茄晚疫病晚疫病品种有渝红2号、圆红、中蔬5号、中蔬4号、佳红、强丰、佳粉10号等品种。轮作换茬：防止连作，应与十字花科蔬菜实行3年以上轮作，避免和马铃薯相邻种植。培育无病壮苗：病菌主要在土壤或病残体中越冬，因此，育苗土必须严格选用没有种植过茄科作物的土壤，提倡用营养钵、营养袋、穴盘等培育无病壮苗。加强田间管理：施足基肥，实行配方施肥，避免偏施氮肥，增施磷、钾肥。定植后要及时防除杂草，根据不同品种结果习性，合理整枝、摘心、打杈，减少养分消耗，促进主茎的生长。合理密植：根据不同品种生育期长短、结果习性，采用不同的密植方式，如：双秆整枝的每亩，栽2000株左右，单秆整枝的每亩栽2500-3500株，合理密植，可改善田间通风透光条件，降低田间湿度，减轻病害的发生。\n' +
      '化学防治：保护地采用烟雾法，在番茄发病初期开始喷洒72.2%普力克水剂800倍液或40%甲霜铜可湿性粉剂、72%克露可湿性粉剂400-600倍液、64%杀毒矾可湿性粉剂500倍液、10%世高1500倍液、50%扑海因异菌脲（浩瀚高科）1000倍液等，隔7-10天喷1次，连续防治4-5天。在疫病大范围发生时，喷洒农药是防治番茄晚疫病最有效的方法，但要注意喷洒药液要及时、周到，以防为主。常用的药剂有：58%甲霜灵锰锌可湿性粉剂500倍液、60%杀毒矾可湿性粉剂500倍液、75%百菌清可湿性粉剂600倍液、50%多菌灵可湿性粉剂500倍液；防治番茄晚疫病晚疫病可用77.2%普力克水剂800倍液。茎部病斑可用高浓度药液涂抹，可选用56%嘧菌酯百菌清1000倍液，50%甲基托布津可湿性粉剂200倍液。不管是病叶喷药或病茎涂药，每7-8天1次，连续2-3 次，但要注意施药后10天不可摘果上市。\n',

  },
  {
    name:'番茄斑点病（Bacterial_spot）',
    jianjie:'1. 病征\n' +
      '- 叶片上出现小而不规则的褐色斑点,边缘不清楚\n' +
      '- 斑点可融合成大片坏死区\n' +
      '- 严重时导致整个叶片脱落\n' +
      '- 果实上出现褐色凹陷性斑点,中心呈水浸状脱落\n' +
      '2 发病条件\n' +
      '- 高温潮湿,25-30°C最适宜发病\n' +
      '- 菌量大、雨量频繁时发病严重\n',
    fangzhi:'1. 选用抗病品种\n' +
      '选择抗病品种是防治番茄斑点病的重要措施。应选择对病原菌具有优良抗性的番茄品种进行栽培。\n' +
      '2. 合理轮作\n' +
      '连作易导致病原菌积累,发病严重。应该进行番茄与非寄主作物的轮作,每季轮换不同作物。\n' +
      '3. 提高田间排水性\n' +
      '通过间排水沟的挖掘,保持田间排水畅通,避免积水。\n' +
      '4. 适当减少氮肥用量\n' +
      '过多氮肥会使番茄生长过旺,提高病害感受性。适当减少氮肥用量,促进适度生长。\n' +
      '5. 及时清除病株\n' +
      '一旦发现病株,要及时拔除并进行焚烧,减少病原传播源。\n' +
      '6. 断茬处理\n' +
      '在连作番茄之前,应进行深度耕作,将残茬深埋或焚烧,减少病原菌的滋生。\n' +
      '7. 药剂防治\n' +
      '在发病高峰期,可以喷施百菌清、柑杆锌等杀菌剂进行防治。或轮喷氧化铜、硫酸铜等铜类杀菌剂。\n' +
      '8. 保持田间卫生\n' +
      '清理田间杂草,防止病原菌在田间和杂草上过冬。\n',
  },
  {
    name:'番茄叶斑病（Septoria_leaf_spot）',
    jianjie:'番茄叶斑病在中国南北各地均有分布。中国上海及长江中下游地区番茄斑枯病的主要发病盛期在4-6月及9-11月。' +
      '常年春季发生重于秋季，年度间早春多雨或梅雨期间多雨的年份发病重；秋季多雨、' +
      '多雾的年份发病重；田块间连作地、排水不良的田块发病较早较重；栽培上种植过密、通风透光差、土壤缺肥，植株生长衰弱的田块发病重。',
    fangzhi:'防治方法主要以农业防治和化学防治为主，首先在播种前种子用52℃温汤浸种30分钟，晾干后播种。' +
      '其次加强栽培管理，最后再发病期结合化学药剂进行防治。如：喷施多效唑、咪鲜胺等三唑类化合物,防治成株期病害。喷施戊唑醇可湿性粉剂,增强番茄抗病性。' +
      '联用氟啶脲和咪鲜胺,提高防治效果。喷施氧化铜、硫酸铜等铜制剂,增强番茄的综合抗病性。连作严重时,烧硫气体熏蒸土壤,消除病原菌源。',
  },
  {
    name:'番茄轮斑病（Target_Spot）',
    jianjie:'主要发生在高温多湿的环境，病原菌可通过气流或雨水传播，叶片、茎秆上出现圆形或不规则形小斑点,' +
      '灰白色,边缘褐色。斑点可扩大融合成大片褐色枯死区，果实出现浅褐色斑块,直径可达1厘米。',
    fangzhi:'1. 使用无病原菌的番茄种子或无病病原的育苗。\n' +
      '2. 进行番茄与非寄主作物的轮作,避免连作。每季轮换不同作物种植。\n' +
      '3. 提高番茄栽培基地的排水性,保持田间排水畅通。\n' +
      '4. 合理密植,适当增加株间距,改善通风条件。\n' +
      '5. 定期检查病情,一旦发现病株,立即拔除并深埋或焚烧。\n' +
      '6. 采收期要及时清除病果,避免果实传播源感染。\n' +
      '7. 定期喷施氧化铜等铜制剂,增强番茄抗病能力。\n' +
      '8. 在雨湿天气,每7-10天喷洒一次多效唑、咪鲜胺等化学杀菌剂。\n' +
      '9. 处理番茄残渣,避免病原菌过冬。秋收后深翻土壤。\n' +
      '10. 种植抗病品种。选育抗轮斑病的番茄新品种。\n',
  },
  {
    name:'番茄黄化曲叶病毒（Yellow_Leaf_Curl_Virus）',
    jianjie:'叶片呈黄化现象,且边缘向下捲曲,植株生长矮化,整体发黄。果实变形,表面出现凹坑和裂果。主要靠蚜虫等穿刺吸食式昆虫传播，也可通过病株接触传播。',
    fangzhi:'1. 选育和使用抗病品种。选择对黄化曲叶病毒具有抗性的番茄品种。\n' +
      '2. 加强田间卫生管理,清除病株和杂草,减少病毒源。\n' +
      '3. 隔离防虫网栽培,阻断病虫的传播。\n' +
      '4. 合理使用杀虫剂,预防和控制蚜虫等虫媒载体的发生。\n' +
      '5. 种植抗虫寄主作物,减少病虫种群数量。\n' +
      '6. 病株拔除后进行焚烧,杜绝继续传播。\n' +
      '7. 轮作,避免连作导致病毒积累。\n' +
      '8. 药剂防治,在蚜虫高峰期喷洒噻虫嗪等药剂。\n' +
      '9. 保持田间排水畅通,减少病原菌存活。\n' +
      '10. 采收后深翻土壤,减少田间病毒积累。\n',
  },
  {
    name:'番茄花叶病毒（Mosaic_virus）',
    jianjie:'叶片出现黄化、褐化环状斑块,后期整片褐化枯萎，果实出现绿色或褐色环斑，病株生长迟缓,整体矮化。',
    fangzhi:'1. 选育和使用抗病品种\n' +
      '选择有抗性的番茄品种,提高抗病能力。\n' +
      '2. 加强田间管理,清除病株和杂草\n' +
      '及时清除病株,减少病毒源,并清除杂草,减少传毒源。\n' +
      '3. 合理使用杀虫剂\n' +
      '在蚜虫等传毒载体高峰期喷洒药剂,切断传毒途径。\n' +
      '4. 设置隔离防虫网\n' +
      '使用防虫网设施栽培,阻隔昆虫的进入。\n' +
      '5. 轮作,避免病毒积累，采用番茄与非寄主作物轮作,降低病毒在田间的积累。\n' +
      '6. 拔除病株进行烧毁，发现病株后及时拔除,并进行焚烧处理,减少传播。\n' +
      '7. 提高田间通风和排水效果，增加株距,提高通风效果,并保持排水顺畅。\n' +
      '8. 药剂防治与生物防治相结合，合理使用化学药剂,同时结合天敌的放养。\n' +
      '9. 夏秋季高温时不连作番茄，高温季节不连作番茄,避免病害暴发。\n',
  },
  {
    name:'番茄双斑点蜘蛛螨（Two-spotted_spider_mite）',
    jianjie:'主要危害番茄叶片,也会为害茄科其他作物，螨虫在叶片下表面吸食,导致叶片出现白色或黄色小斑点，严重时导致叶片枯黄、植株生长不良。高温干燥的环境有利发育。',
    fangzhi:'1. 选育抗螨品种\n' +
      '选择对蜘蛛螨具有抗性的番茄品种。\n' +
      '2. 定期检查叶片\n' +
      '常规观察叶片,发现蜘蛛螨早期痕迹后立即处理。\n' +
      '3. 保持适度湿度\n' +
      '控制温湿条件,使蜘蛛螨生存不利。避免镇静剂应用后增加湿度。\n' +
      '4. 隔离栽培\n' +
      '采用大棚隔离栽培,阻断螨源入侵。\n' +
      '5. 轮作\n' +
      '番茄轮作,减少蜘蛛螨在田间的积累。\n' +
      '6. 喷施杀螨剂\n' +
      '在蜘蛛螨高峰期使用磺胺嘧啶等杀螨剂进行喷洒。\n' +
      '7. 消毒土壤\n' +
      '使用氯气、六亚硝酸钠等进行土壤消毒,减少螨源。\n' +
      '8. 引入天敌\n' +
      '释放捕食性天敌如食螨菌、瓢虫等进行生物防治。\n',
  },
  {
    name:'番茄白粉病（Powdery_mildew）',
    jianjie:'1. 发病初期,在叶片上面出现白色粉状菌丝,逐渐扩大成不规则斑块。2. 病斑可见菌丝形成的同心环,中央稍凹陷。斑边不清晰。' +
      '3. 叶背对应斑块位置可见黄化或褐色胼胝体。严重时可遍布整个叶面。4. 老叶受害最重,蔓延至茎秆和果实。严重时可能导致植株萎蔫。5. 叶片被严重侵染时会皱缩变硬,白粉病斑可脱落而露出叶绿体。' +
      '6. 病害发生在气候温暖潮湿,通风不良的环境。7. 可通过风或雨水向附近的番茄植株传播病原菌。8. 可造成番茄花果减产、质量下降。严重时导致植株枯死 。',
    fangzhi:'1. 选择抗病品种,如含有对白粉病菌抗性的品种。2. 隔离生长,保持通风,减少空气湿度。避免栽培密度过高。' +
      '3. 进行适当的化学药剂防治,如使用噻霉唑、戊唑醇等防治药物,定期喷雾。4. 进行物理防治,如叶面喷洒食醋、生石灰水等,可以降低孢子活性。' +
      '5. 保持田间卫生,清除病株,避免病原菌积累。6. 轮作,不连作番茄,避免菌源积累。7. 促进通风和光照,减少潮湿环境,控制温度和湿度。' +
      '8. 合理施肥,避免过度施氮肥,这会使番茄更易感染。9. 发现病株后立即上报,并拔除烧毁,防止蔓延。10. 结合药剂防治和栽培管理措施,综合治理白粉病。',
  },
]
)
</script>
<style scoped>
.el-carousel__item h3 {
  color: #475669;
  opacity: 0.75;
  line-height: 200px;
  margin: 0;
  text-align: center;
}

.el-carousel__item:nth-child(2n) {
  background-color: #99a9bf;
}

.el-carousel__item:nth-child(2n + 1) {
  background-color: #d3dce6;
}
</style>
